[
  {
    "toyId": 1,
    "toyName": "Lego Classic Bricks",
    "sellerName": "Toys R Us Local",
    "sellerEmail": "contact@toysruslocal.com",
    "price": 49.99,
    "rating": 4.7,
    "reviews": 160,
    "availableQuantity": 75,
    "description": "A timeless set of colorful Lego bricks that encourages creativity, critical thinking, and problem-solving skills. This set includes various brick sizes and colors, allowing kids to design endless models—from vehicles to houses. With no fixed instructions, it empowers free play, fostering independence and imagination. Children can recreate scenes, build original ideas, or follow included inspiration guides. Ideal for solo or group activities, it strengthens social skills and motor coordination. Built to last and compatible with other Lego sets, it offers years of fun. Perfect for kids aged 4 and up, it’s a classic gift that never goes out of style.",
    "pictureURL": "https://i.ibb.co.com/vNDJzmz/10713-Prod.png",
    "subCategory": "Building Blocks"
  },
  {
    "toyId": 2,
    "toyName": "Fisher-Price Laugh & Learn Puppy",
    "sellerName": "Baby World",
    "sellerEmail": "sales@babyworld.com",
    "price": 29.95,
    "rating": 4.6,
    "reviews": 155,
    "availableQuantity": 120,
    "description": "This interactive plush puppy teaches letters, numbers, colors, and body parts through fun songs, phrases, and lights. Soft, cuddly, and responsive to touch, it’s perfect for toddlers learning to speak and explore. The puppy responds when its hands, feet, or heart are pressed, making playtime engaging and educational. It includes over 75 songs and sounds that develop fine motor skills and memory. Designed for babies 6 months and up, it adapts to the child’s developmental stage with Smart Stages technology. An excellent first learning toy, it keeps kids entertained while helping build early language and sensory skills in a fun way.",
    "pictureURL": "https://i.ibb.co.com/kgnF31PQ/66458555449374.jpg",
    "subCategory": "Interactive Toys"
  },
  {
    "toyId": 3,
    "toyName": "Hot Wheels Mega Garage Playset",
    "sellerName": "Speedy Toys",
    "sellerEmail": "info@speedytoys.com",
    "price": 64.99,
    "rating": 4.5,
    "reviews": 200,
    "availableQuantity": 60,
    "description": "This multi-level Hot Wheels Mega Garage Playset includes elevators, ramps, and parking for over 35 cars. It features a manual crank elevator, twisting ramps, and a side launcher for fast-paced races. Perfect for car enthusiasts, it offers endless imaginative play as kids service, store, and launch their vehicles across the tracks. It enhances storytelling, hand-eye coordination, and fine motor skills. Designed for kids aged 5 and up, the durable structure ensures hours of entertainment. Compatible with most Hot Wheels vehicles, this set is a must-have for expanding any collection and inspiring high-octane adventures every time children gather to play.",
    "pictureURL": "https://i.ibb.co.com/6cF0VJcK/Hot-Wheels-GTT95-City-Mega-Garage-Playse-Non-Brand-9d405-466940.png",
    "subCategory": "Vehicles"
  },
  {
    "toyId": 4,
    "toyName": "Melissa & Doug Wooden Puzzle Set",
    "sellerName": "Wooden Wonders",
    "sellerEmail": "support@woodenwonders.com",
    "price": 22.5,
    "rating": 4.8,
    "reviews": 50,
    "availableQuantity": 90,
    "description": "This set of high-quality wooden puzzles includes farm animals, vehicles, and alphabet pieces, designed to promote fine motor skills, shape recognition, and problem-solving. Each puzzle has sturdy wooden pieces with matching pictures underneath, making learning intuitive and fun. Great for preschoolers, it encourages cognitive development and hand-eye coordination. Durable construction ensures long-lasting use in both classrooms and homes. Parents love how it supports early learning without screens. The vibrant illustrations and easy-to-handle pieces are ideal for small hands. It's a safe, engaging way to foster early educational milestones, making it a thoughtful gift for toddlers and preschool-aged children alike.",
    "pictureURL": "https://i.ibb.co.com/gLcYmnNC/2024-06-19-61995080-e1f6-4a08-8d69-8c455357259f.webp",
    "subCategory": "Educational Toys"
  },
  {
    "toyId": 5,
    "toyName": "Barbie Dreamhouse",
    "sellerName": "Doll World",
    "sellerEmail": "barbie@dollworld.com",
    "price": 199.99,
    "rating": 4.9,
    "reviews": 180,
    "availableQuantity": 30,
    "description": "The Barbie Dreamhouse is a 3-story home packed with luxury features including a working elevator, pool, slide, and interactive lights and sounds. Designed for imaginative storytelling, it comes fully furnished with over 70 accessories. Kids can cook in the kitchen, relax in the living room, or host parties on the rooftop. Its modern design inspires endless adventures and role-play scenarios. Ideal for kids aged 3 and up, the Dreamhouse encourages creativity and fine motor development. The sturdy build and vibrant colors ensure durability and visual appeal. It’s the ultimate dollhouse for Barbie fans and a showstopper in any playroom.",
    "pictureURL": "https://i.ibb.co.com/p6NBhfcd/81-Jv0-NLb-Yu-L-AC-SL1500.jpg",
    "subCategory": "Dolls"
  },
  {
    "toyId": 6,
    "toyName": "Nerf Elite 2.0 Shockwave Blaster",
    "sellerName": "Action Hub",
    "sellerEmail": "support@actionhub.com",
    "price": 39.99,
    "rating": 4.4,
    "reviews": 138,
    "availableQuantity": 100,
    "description": "This Nerf Elite 2.0 Shockwave blaster delivers high-energy dart action with a 30-dart rotating drum. Featuring pump-action priming and three tactical rails, it allows customization with accessories. Kids can take on fun missions with this powerful, easy-to-load blaster that fires up to 90 feet. Great for solo or team play, it improves hand-eye coordination and active movement. Durable design ensures long-lasting use in indoor or outdoor settings. Includes 30 official Nerf darts made of foam for safe, competitive fun. Ideal for kids 8 years and older, it’s a perfect gift for thrill-seekers who enjoy fast-paced action and strategic play.",
    "pictureURL": "https://i.ibb.co.com/ZpqP9fzd/46d0c8bc8d233845d2032aa0684df72d-jpg-720x720q80.jpg",
    "subCategory": "Outdoor Toys"
  },
  {
    "toyId": 7,
    "toyName": "Crayola Inspiration Art Case",
    "sellerName": "Creative Corner",
    "sellerEmail": "hello@creativecorner.com",
    "price": 24.99,
    "rating": 4.8,
    "reviews": 208,
    "availableQuantity": 80,
    "description": "This portable Crayola Inspiration Art Case includes 140 pieces—crayons, markers, colored pencils, and paper. Perfect for young artists, it encourages creativity, color recognition, and fine motor skills. The sturdy case keeps art supplies organized and easy to carry. Kids can sketch, color, or write anywhere they go. Ideal for rainy days, travel, or quiet play, it’s suitable for children aged 4 and up. All materials are non-toxic and safe. This art set inspires hours of artistic expression and helps build confidence in young creators. A wonderful gift for birthdays, holidays, or any child who loves to express themselves through drawing.",
    "pictureURL": "https://i.ibb.co.com/3mqp4BL9/91-qafy-A4-TL-AC-UF894-1000-QL80.jpg",
    "subCategory": "Arts & Crafts"
  },
  {
    "toyId": 8,
    "toyName": "Play-Doh 36-Pack Colors Set",
    "sellerName": "Crafty Kids",
    "sellerEmail": "orders@craftykids.com",
    "price": 19.99,
    "rating": 4.9,
    "reviews": 98,
    "availableQuantity": 150,
    "description": "This Play-Doh set features 36 vibrant colors, offering endless creative possibilities. Kids can sculpt, mix, and mold whatever they imagine—from animals to food items. Made from non-toxic materials, it’s safe for young children and easy to clean up. The soft, pliable texture helps build hand strength and fine motor skills while promoting imaginative play. Whether used in classrooms, at home, or during parties, it’s a favorite for open-ended fun. The resealable tubs keep dough fresh and organized. A great resource for sensory play, this set supports artistic development and collaboration in a fun, colorful way that kids adore.",
    "pictureURL": "https://i.ibb.co.com/wjXFY3q/612-QCd-o2f-L-UF894-1000-QL80.jpg",
    "subCategory": "Arts & Crafts"
  },
  {
    "toyId": 9,
    "toyName": "RC Stunt Car 360° Spinner",
    "sellerName": "ZoomZoom Toys",
    "sellerEmail": "rc@zoomzoomtoys.com",
    "price": 34.99,
    "rating": 4.3,
    "reviews": 150,
    "availableQuantity": 85,
    "description": "This Remote-Controlled Stunt Car performs 360° spins, flips, and tricks on any terrain. With large wheels and dual motors, it’s built for speed and durability. Kids can race indoors or outdoors, navigating through grass, sand, or pavement. Easy to control and rechargeable, it offers endless action-packed fun. The LED lights add excitement during night play. Designed for children aged 6 and above, it boosts coordination, focus, and spatial awareness. Comes with a 2.4GHz remote for stable signal and responsive commands. An exciting gift for RC fans, this car is built to thrill and designed to handle every flip, turn, and twist.",
    "pictureURL": "https://i.ibb.co.com/Ngn64qT2/51-LE7-OMwqi-L.jpg",
    "subCategory": "Remote Control"
  },
  {
    "toyId": 10,
    "toyName": "VTech KidiZoom Camera Pix",
    "sellerName": "Techie Tots",
    "sellerEmail": "info@techietots.com",
    "price": 44.95,
    "rating": 4.4,
    "reviews": 130,
    "availableQuantity": 65,
    "description": "The VTech KidiZoom Camera Pix is a kid-friendly digital camera with fun effects and built-in games. Designed for budding photographers aged 3 to 8, it features a durable frame, 4X zoom, and front-facing camera for selfies. Kids can add stamps, frames, and filters to their photos for extra creativity. It also records videos and stores hundreds of images with expandable memory via microSD card. Encourages visual storytelling, fine motor development, and imaginative exploration. Easy to use and built to withstand rough handling, it’s perfect for everyday adventures. A fun way to introduce kids to the world of photography and media.",
    "pictureURL": "https://i.ibb.co.com/m5WTnr8b/712-B3k-Rhb-L.jpg",
    "subCategory": "Electronic Toys"
  },
  {
    "toyId": 11,
    "toyName": "Magna-Tiles Clear Colors 100-Piece Set",
    "sellerName": "STEM Playhouse",
    "sellerEmail": "service@stemplayhouse.com",
    "price": 119.99,
    "rating": 4.9,
    "reviews": 233,
    "availableQuantity": 45,
    "description": "This 100-piece Magna-Tiles set includes magnetic squares and triangles in vibrant colors that easily connect to form 2D and 3D shapes. Perfect for developing math, science, and spatial skills, these tiles encourage problem-solving and imaginative play. Made from durable, non-toxic plastic, they’re safe for kids and easy to clean. Ideal for both classrooms and homes, this open-ended toy promotes collaborative play and creativity in children aged 3 and up. Whether building castles, animals, or towers, Magna-Tiles offer hours of educational fun. A must-have for budding engineers, architects, and creative thinkers who love hands-on, screen-free play that stimulates learning.",
    "pictureURL": "https://i.ibb.co.com/C541C58j/Magna-Tiles-Clear-Colors-100-Piece-Set-Construction-Magna-Tiles-Toycra-7-700x700.webp",
    "subCategory": "STEM Toys"
  },
  {
    "toyId": 12,
    "toyName": "UNO Card Game",
    "sellerName": "Game Time Store",
    "sellerEmail": "support@gametimestore.com",
    "price": 7.99,
    "rating": 4.8,
    "reviews": 100,
    "availableQuantity": 200,
    "description": "UNO is the classic card game of color and number matching that’s easy to learn and fun for all ages. Great for family game nights, it helps children develop strategic thinking, pattern recognition, and number skills. Featuring action cards like Skip, Reverse, and Wild Draw Four, each game is full of surprises and laughter. Compact and portable, UNO is perfect for travel and gatherings. Designed for 2 to 10 players aged 7 and up, it promotes social interaction and sportsmanship. Whether at home or on the go, UNO delivers timeless, fast-paced fun and friendly competition in every round played.",
    "pictureURL": "https://i.ibb.co.com/8D2MHGDC/f26d42346e660cd249db11f8bdab6132-jpg-960x960q80-jpg.webp",
    "subCategory": "Games & Puzzles"
  },
  {
    "toyId": 13,
    "toyName": "Little Tikes Cozy Coupe",
    "sellerName": "Outdoor Kiddos",
    "sellerEmail": "info@outdoorkiddos.com",
    "price": 69.99,
    "rating": 4.7,
    "reviews": 176,
    "availableQuantity": 40,
    "description": "The Little Tikes Cozy Coupe is a classic ride-on toy that provides active outdoor fun for toddlers. Designed with a working horn, ignition switch, and opening gas cap, it promotes imaginative role-play and gross motor skills. Kids can use foot power to move or let parents push using the built-in handle. Its sturdy design and removable floorboard ensure years of use for children aged 18 months to 5 years. With its bright red-and-yellow design and smiling face, it’s beloved by generations. Ideal for backyard adventures or driveway cruising, this iconic coupe sparks joy, movement, and creativity in every ride.",
    "pictureURL": "https://i.ibb.co.com/yc5FkLYC/172502-large.jpg",
    "subCategory": "Ride-Ons"
  },
  {
    "toyId": 14,
    "toyName": "LeapFrog My First Learning Tablet",
    "sellerName": "Tiny Tech Store",
    "sellerEmail": "hello@tinytech.com",
    "price": 27.5,
    "rating": 4.5,
    "reviews": 210,
    "availableQuantity": 95,
    "description": "LeapFrog’s My First Learning Tablet introduces letters, numbers, shapes, and music through interactive buttons, lights, and sounds. Designed for toddlers aged 12 months and up, it mimics a real tablet while offering age-appropriate educational content. It includes over 20 songs and activities, helping children learn through repetition and fun. Durable and easy to hold, it encourages early language skills and hand-eye coordination. Parents appreciate the bilingual (English/Spanish) options and volume control. Great for independent play or parent-guided learning, this tablet keeps little ones engaged and learning on the go. A perfect tool for screen-free tech-inspired education and entertainment.",
    "pictureURL": "https://i.ibb.co.com/d0YXcGQz/my-first-learning-tablet-purple-80-602960-1.jpg",
    "subCategory": "Electronic Toys"
  },
  {
    "toyId": 15,
    "toyName": "Jenga Classic",
    "sellerName": "Family Game Depot",
    "sellerEmail": "orders@familygamedepot.com",
    "price": 14.95,
    "rating": 4.9,
    "reviews": 252,
    "availableQuantity": 150,
    "description": "Jenga is the classic stacking game of physical skill, tension, and laughter. Consisting of 54 precision-crafted hardwood blocks, the game challenges players to remove and stack pieces without toppling the tower. Suitable for kids and adults aged 6 and up, it enhances focus, hand-eye coordination, and problem-solving. Great for parties, classrooms, or family game night, Jenga requires patience and a steady hand. Simple to set up and endlessly replayable, it’s a favorite worldwide. The natural wood blocks come in a convenient box for easy storage. Jenga is a timeless test of balance, fun, and nerve that never gets old.",
    "pictureURL": "https://i.ibb.co.com/C3rYZp8c/67bc9f873664456a64b62144.webp",
    "subCategory": "Games & Puzzles"
  },
  {
    "toyId": 16,
    "toyName": "Melissa & Doug Grocery Store Playset",
    "sellerName": "Little Pretenders",
    "sellerEmail": "support@littlepretenders.com",
    "price": 129.99,
    "rating": 4.8,
    "reviews": 145,
    "availableQuantity": 25,
    "description": "This wooden Grocery Store Playset by Melissa & Doug offers a realistic shopping experience for kids. Featuring a hand-cranked conveyor belt, scanner, card swiper, and shelves, it promotes imaginative role-play and social development. Perfect for children aged 3 and up, it encourages counting, sorting, and customer interaction. Crafted from durable wood with vibrant details, the set pairs well with toy food and accessories. Ideal for both solo and group play, it helps build communication and organization skills. Great for aspiring little shopkeepers, this set turns playtime into a fun and educational adventure that feels just like the real thing.",
    "pictureURL": "https://i.ibb.co.com/VYbFDXq8/71-A1-Ngm-KFYL.jpg",
    "subCategory": "Pretend Play"
  },
  {
    "toyId": 17,
    "toyName": "Thomas & Friends TrackMaster Train Set",
    "sellerName": "Train World",
    "sellerEmail": "help@trainworld.com",
    "price": 49.99,
    "rating": 4.6,
    "reviews": 120,
    "availableQuantity": 70,
    "description": "The Thomas & Friends TrackMaster Train Set brings the Island of Sodor to life with motorized trains and customizable tracks. Featuring Thomas and his friends, the set inspires storytelling, creativity, and early engineering skills. Children can build different track layouts, enhancing spatial reasoning and problem-solving. Designed for kids aged 3 and older, this durable set includes bridge pieces, tunnels, and train engines with simple snap-together assembly. Compatible with other TrackMaster sets, it expands with your child’s imagination. Whether it’s a solo mission or shared play, kids will love guiding Thomas on exciting adventures full of discovery and friendly fun.",
    "pictureURL": "https://i.ibb.co.com/bjqBZj88/1557953918931585705-800x800.webp",
    "subCategory": "Vehicles"
  },
  {
    "toyId": 18,
    "toyName": "VTech Sit-to-Stand Learning Walker",
    "sellerName": "Grow With Me Toys",
    "sellerEmail": "contact@growwithmetoys.com",
    "price": 39.95,
    "rating": 4.9,
    "reviews": 220,
    "availableQuantity": 110,
    "description": "This VTech Sit-to-Stand Learning Walker helps babies transition from crawling to walking while engaging them with lights, sounds, and educational activities. The removable activity panel includes shape sorters, spinning gears, and piano keys that teach numbers, colors, and animals. Designed for babies aged 9 months and older, it supports motor skill development and early learning. The sturdy frame and easy-grip handle offer stability and safety. With over 70 songs and sound effects, it provides endless entertainment and learning opportunities. Encouraging movement and interaction, this walker grows with your child and is a parent-approved favorite for developmental playtime fun.",
    "pictureURL": "https://i.ibb.co.com/TJq6VxQ/80-505650-Main-large.jpg",
    "subCategory": "Baby Toys"
  },
  {
    "toyId": 19,
    "toyName": "Hape Pound & Tap Bench with Xylophone",
    "sellerName": "EcoToys",
    "sellerEmail": "eco@ecotoys.com",
    "price": 29.99,
    "rating": 4.7,
    "reviews": 175,
    "availableQuantity": 80,
    "description": "This award-winning wooden toy combines musical exploration and motor skill development in one. Kids can pound the colorful balls through the holes, which then roll down onto a removable xylophone to create fun musical notes. Encouraging cause-and-effect learning, this toy is crafted with non-toxic finishes and sustainable materials. Designed for toddlers aged 12 months and up, it improves hand-eye coordination, rhythm, and color recognition. The xylophone can also be played separately, offering two toys in one. Perfect for sensory play and early education, this Hape Pound & Tap Bench is a timeless, eco-friendly toy parents and children both love.",
    "pictureURL": "https://i.ibb.co.com/1YYYhgtR/9-DE0305-1.webp",
    "subCategory": "Musical Toys"
  },
  {
    "toyId": 20,
    "toyName": "Pokemon Trading Card Game Starter Set",
    "sellerName": "Card Masters",
    "sellerEmail": "info@cardmasters.com",
    "price": 14.99,
    "rating": 4.9,
    "reviews": 210,
    "availableQuantity": 200,
    "description": "This Pokémon Trading Card Game Starter Set is perfect for new trainers looking to jump into the action. Each box includes two ready-to-play decks, rulebooks, damage counters, a playmat, and exclusive holographic cards. Kids can learn the rules of battle, build strategies, and collect their favorite characters. The game enhances math, reading, and critical thinking skills while promoting social interaction and friendly competition. Suitable for players aged 6 and older, it’s a great entry into the world of Pokémon. Ideal for both solo and group play, this set offers endless replay value and excitement for fans of all ages.",
    "pictureURL": "https://i.ibb.co.com/5gxb3Smz/pokemon-trading-card-game-tabletop-button-1561655017581.webp",
    "subCategory": "Collectibles"
  }
]
